(setq *PRINT-CASE* :capitalize)

(format t "(+ 6 7) = ~d ~%" (+ 6 7))
;;; (+ 6 7) = 13 

(format t "(- 6 7) = ~d ~%" (- 6 7))
;;; (- 6 7) = -1

(format t "(* 6 7) = ~d ~%" (* 6 7))
;;; (* 6 7) = 42 

(format t "(/ 67 7) = ~d ~%" (/ 67 7))
;;; (/ 67 7) = 67/7 
;;; 不能化简

(format t "(/ 70 7) = ~d ~%" (/ 70 7))
;;; (/ 70 7) = 10
;;; 能直接等于一个整数

(format t "(/ 6 4) = ~d ~%" (/ 6 4))
;;; (/ 6 4) = 3/2
;;; 能化简（约分）

(format t "(/ 67 7.0) = ~d ~%" (/ 67 7.0))
;;; (/ 67 7.0) = 9.571428 

(format t "(rem 67 7) = ~d ~%" (rem 67 7))
;;; (rem 67 7) = 4 

(format t "(mod 67 7) = ~d ~%" (mod 67 7))
;;; (mod 67 7) = 4 