(define (cubde x) (* x x x))

(define (p x) (- (* 3 x) (* 4 (cube x))))

(define (sine angle)
    (if (not (> (abs angle) 0.1))
        angle
        (begin (newline)
               (display "(p (sine (")
               (display (/ angle 3.0))
               (display ")))")
               (p (sine (/ angle 3.0))))))

(sine 12.15)
#||
(p (sine (4.05)))
(p (sine (1.3499999999999999)))
(p (sine (.44999999999999996)))
(p (sine (.15)))
(p (sine (4.9999999999999996e-2)))
;Value: -.39980345741334
p 共运行了 5 次
||#

(sine 30)
#||
(p (sine (10.)))
(p (sine (3.3333333333333335)))
(p (sine (1.1111111111111112)))
(p (sine (.3703703703703704)))
(p (sine (.1234567901234568)))
(p (sine (.0411522633744856)))
;Value: -.9866890379958478
p 共运行了 6 次
||#

(sine 99)
#||
(p (sine (33.)))
(p (sine (11.)))
(p (sine (3.6666666666666665)))
(p (sine (1.222222222222222)))
(p (sine (.4074074074074074)))
(p (sine (.13580246913580246)))
(p (sine (.04526748971193415)))
;Value: -.9972873327765317
p 共运行了 7 次
||#

#||
(sine n) 是一个递归程序，时间和空间复杂度都是 O(log n)，
每当 a 增大为原来的 3 倍， p 的运行次数就会增加 1 次。
||#